# RebarShapeConstraintDiameter Class

---
A diameter constraint associated with an arc in a RebarShapeDefinition.
SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintDiameter
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class RebarShapeConstraintDiameter : RebarShapeConstraint

    Public Class RebarShapeConstraintDiameter
    	Inherits RebarShapeConstraint

    public ref class RebarShapeConstraintDiameter : public RebarShapeConstraint

    type RebarShapeConstraintDiameter =
        class
            inherit RebarShapeConstraint
        end
The RebarShapeConstraintDiameter type exposes the following members.
| Name| Description
---|---|---
| RebarShapeConstraintDiameter|  Create a diameter constraint.
Top
| Name| Description
---|---|---
| ArcReferenceType|  The choice of rule for measuring the diameter.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from RebarShapeConstraint)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetParamId|  Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace